In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randn(4,3), ['a', 'b', 'c', 'e'], ['Y', 'X', 'Z'])

In [3]:
df

          Y         X         Z
a  0.339937  0.291110 -0.001943
b -0.651279 -0.866665  0.915291
c -0.258314 -2.861288  0.780775
e  0.408928 -0.252601  0.562947

In [4]:
df > 0

       Y      X      Z
a   True   True  False
b  False  False   True
c  False  False   True
e   True  False   True

In [5]:
df[df>0]

          Y        X         Z
a  0.339937  0.29111       NaN
b       NaN      NaN  0.915291
c       NaN      NaN  0.780775
e  0.408928      NaN  0.562947

In [6]:
df['Z']>0.5

a    False
b     True
c     True
e     True
Name: Z, dtype: bool

In [8]:
df[df['Y']>0.2]

          Y         X         Z
a  0.339937  0.291110 -0.001943
e  0.408928 -0.252601  0.562947

In [20]:
res_df = df[df['Y']>0]['Z']

In [21]:
res_df

a   -0.001943
e    0.562947
Name: Z, dtype: float64

In [27]:
df.loc['e']['Z']

0.5629468455961619

In [30]:
df.iloc[3]['Z']

0.5629468455961619

In [33]:
df[df['Y']>0]['Z']['e']

0.5629468455961619

In [34]:
df

          Y         X         Z
a  0.339937  0.291110 -0.001943
b -0.651279 -0.866665  0.915291
c -0.258314 -2.861288  0.780775
e  0.408928 -0.252601  0.562947

In [35]:
df[(df['Y']>0) & (df['X']<0)]

          Y         X         Z
e  0.408928 -0.252601  0.562947

In [49]:
df_2 = df.copy()

In [50]:
df_2

          Y         X         Z
a  0.339937  0.291110 -0.001943
b -0.651279 -0.866665  0.915291
c -0.258314 -2.861288  0.780775
e  0.408928 -0.252601  0.562947

In [51]:
df_2.reset_index(inplace=True)

In [47]:
df_2

   level_0 index         Y         X         Z
0        0     a  0.339937  0.291110 -0.001943
1        1     b -0.651279 -0.866665  0.915291
2        2     c -0.258314 -2.861288  0.780775
3        3     e  0.408928 -0.252601  0.562947

In [53]:
dz_df = pd.DataFrame(np.random.randint(1,101,20).reshape(5,4), [10,20,30,40,50],['A','B','C','D'])

In [54]:
dz_df

     A   B    C   D
10  26  33  100  57
20   4  35   78  34
30  87  14   35  30
40  40  49   65  63
50  33  97   58  23

In [56]:
dz_df[dz_df['A']<30]

     A   B    C   D
10  26  33  100  57
20   4  35   78  34

In [57]:
dz_df[(dz_df['A']<50) | (dz_df['B']<40)]

     A   B    C   D
10  26  33  100  57
20   4  35   78  34
30  87  14   35  30
40  40  49   65  63
50  33  97   58  23

In [60]:
dz_df[(dz_df['C']>20) & (dz_df['D']<70)][['A','B']]

     A   B
10  26  33
20   4  35
30  87  14
40  40  49
50  33  97